{
  "errorJustifications": {
    "E1": "Assinatura do Hash não confere. Reenvie a assinatura do Hash conforme algoritmo estabelecido no Manual de Instrução da NFS-e.",
    "E2": "Mês de competência superior ao de emissão do RPS ou da Nota. Informe um mês de competência inferior ou igual ao de emissão do RPS ou da Nota.",
    "E3": "Natureza da operação não informada. Utilize um dos tipos: 01 – Tributação no município; 02 – Tributação fora do município; 03 – Isenção; 04 – Imune; 05 – Exigibilidade suspensa por decisão judicial; 06 – Exigibilidade suspensa por procedimento administrativo.",
    "E4": "Esse RPS não foi enviado para a nossa base de dados. Envie o RPS para emissão da NFS-e.",
    "E5": "O número da NFS-E substituída informado não existe na base de dados do município. Informe um número de NFS-E substituída que já tenha sido emitida.",
    "E6": "Essa NFS-e não pode ser cancelada através desse serviço, pois há crédito informado. O cancelamento de uma NFS-e com crédito deve ser feito através de processo administrativo aberto em uma repartição fazendária.",
    "E7": "Essa NFS-e já foi substituída. Confira e informe novamente os dados da NFS-e que deseja substituir.",
    "E8": "Campo de optante pelo simples nacional não informado. Utilize um dos tipos: 1 – Sim; 2 - Não.",
    "E9": "Campo de incentivador cultural não informado. Utilize um dos tipos: 1 – Sim; 2 - Não.",
    "E10": "RPS já informado. Para essa Inscrição Municipal/CNPJ já existe um RPS informado com o mesmo número, série e tipo.",
    "E11": "Número do RPS não informado. Informe o número do RPS.",
    "E12": "Tipo do RPS não informado. Informe o tipo do RPS.",
    "E13": "Campo tipo do RPS inválido. Utilize um dos tipos especificados: 'RPS', 'RPS-C' ou 'RPSM'.",
    "E14": "Data da emissão do RPS não informada. Informe a Data da emissão do RPS no formato Date.",
    "E15": "Data da emissão do RPS inválida. Informe a Data da emissão do RPS no formato Date.",
    "E16": "A data da emissão do RPS não poderá ser superior a data de hoje. Informe uma data de emissão de RPS válida.",
    "E17": "A data da emissão do RPS não poderá ser inferior à data de habilitação do prestador para emissão da NFS-e. Informe uma data de emissão de RPS válida.",
    "E18": "O valor dos serviços deverá ser superior a R$ 0,00 (zero). Não é permitido envio de valor de serviços igual a zero.",
    "E19": "O valor das deduções deverá ser inferior ou igual ao valor dos serviços. Não é permitido valor de dedução superior ao valor de serviços.",
    "E20": "O valor das deduções deverá ser superior ou igual a R$ 0,00 (zero). Não é permitido valor de dedução inferior a zero (negativo).",
    "E21": "O valor dos descontos deverá ser inferior ou igual ao valor dos serviços. Não é permitido valor de desconto superior ao valor de serviços.",
    "E22": "O valor dos descontos deverá ser superior ou igual a R$ 0,00 (zero). Não é permitido valor de desconto inferior a zero (negativo).",
    "E23": "O valor do PIS deverá ser superior ou igual a R$ 0,00 (zero). Não é permitido valor de retenção inferior a zero (negativo).",
    "E24": "O valor da Cofins deverá ser superior ou igual a R$ 0,00 (zero). Não é permitido valor de retenção inferior a zero (negativo).",
    "E25": "O valor do INSS deverá ser superior ou igual a R$ 0,00 (zero). Não é permitido valor de retenção inferior a zero (negativo).",
    "E26": "O valor do IR deverá ser superior ou igual a zero. Não é permitido valor de retenção inferior a zero.",
    "E27": "O valor da CSLL deverá ser superior ou igual a R$ 0,00 (zero). Não é permitido valor de retenção inferior a zero (negativo).",
    "E28": "Item da lista de serviço informado é incompatível com a informação de optante pelo simples nacional. Consulte a legislação vigente para saber se o item informado permite a opção pelo simples nacional.",
    "E29": "O código de serviço prestado não permite retenção de ISS. Altere o campo 'ISS Retido' para: 2 (Nota Fiscal sem ISS Retido).",
    "E30": "Item da lista de serviço inexistente. Consulte a legislação vigente para saber o item da lista de serviço que deverá ser informado neste campo.",
    "E31": "Item da lista de serviço não informado para a operação. Informe o item relativo ao serviço prestado nessa operação.",
    "E32": "Código CNAE informado é incompatível com a informação de optante pelo simples nacional. Consulte a legislação vigente para saber se o código informado permite a opção pelo simples nacional.",
    "E33": "Código CNAE inexistente. Consulte a legislação vigente para saber o código CNAE que deverá ser informado neste campo.",
    "E34": "Código de tributação informado é incompatível com a informação de optante pelo simples nacional. Consulte a legislação vigente para saber se o código informado permite a opção pelo simples nacional.",
    "E35": "Código de tributação inexistente. Consulte a legislação vigente para saber o Código de tributação que deverá ser informado neste campo.",
    "E36": "Campo ISSRetido inválido. Utilize um dos tipos: 1 para ISS Retido ou 2 para ISS não Retido.",
    "E37": "Apenas serviços tributados, no município ou fora, podem sofrer retenção de ISS. Operações isentas, imunes ou com exigibilidade suspensa por decisão judicial ou procedimento administrativo não podem sofrer retenção de ISS.",
    "E38": "Contribuintes enquadrados como Microempresa Municipal, Estimativa, Sociedade de Profissionais ou Incentivador Cultural não podem sofrer retenção de ISS. Não faça a retenção do ISS nos casos de empresas enquadradas como Microempresa Municipal, Estimativa, Sociedade de Profissionais ou Incentivador Cultural.",
    "E39": "Apenas empresas tomadoras de serviços inscritas neste município podem efetuar retenção de ISS. O CNPJ e/ou a Inscrição Municipal informada do tomador não foi encontrada na base de dados do município, não sendo permitida a retenção. Acerte o CNPJ e/ou Inscrição Municipal ou altere o campo ISS Retido para 2 (Sem retenção de ISS).",
    "E40": "Valor do ISS retido não informado. O valor do ISS retido deve ser informado quando o campo 'IssRetido' for marcado com 1- Sim.",
    "E41": "O campo discriminação dos serviços não foi preenchido. O preenchimento da discriminação dos serviços é obrigatório por lei, devendo ser preenchido adequadamente.",
    "E42": "Código do município da prestação do serviço inválido. Consulte a tabela do IBGE e utilize um dos tipos listados na tabela.",
    "E43": "Inscrição Municipal do prestador não encontrada na base de dados do município. Informe a inscrição municipal correta do prestador.",
    "E44": "CNPJ do prestador inválido. Informe o número do CNPJ correto do prestador.",
    "E45": "CNPJ não encontrado na base de dados. Confira o número do CNPJ informado. Caso esteja correto, o prestador não está inscrito no município.",
    "E46": "CNPJ do prestador não informado. Informe o CNPJ do prestador.",
    "E47": "CPF/CNPJ do tomador inválido. Informe o CPF/CNPJ correto do tomador.",
    "E48": "O campo CPF/CNPJ do tomador deverá ser preenchido com zeros quando for de CPF não-informado. Preencha o campo CPF/CNPJ do Tomador com zeros quando se tratar de tomador com CPF não informado.",
    "E49": "Lote de RPS com excesso de inconsistências. O serviço de validação de RPS é abortado quando atinge o número de 50 inconsistências. Corrija os erros e reenvie o lote de RPS.",
    "E50": "Inscrição Municipal do prestador inválida. Informe a inscrição municipal correta do prestador.",
    "E51": "Inscrição Municipal do tomador inválida. Informe a inscrição municipal correta do tomador.",
    "E52": "O tomador de serviços informado é o próprio prestador. Na emissão da NFS-e não é permitido que o prestador seja igual ao tomador.",
    "E53": "O campo Inscrição Municipal do tomador só deverá ser preenchido para tomadores estabelecidos neste município. Para tomadores estabelecidos fora deste município, não preencher inscrição municipal.",
    "E54": "CNPJ do tomador está vinculado a mais de uma inscrição municipal. Informe a Inscrição Municipal do tomador vinculada ao CNPJ informado.",
    "E55": "Endereço do tomador (logradouro) não corresponde ao CEP informado. Corrija o endereço (logradouro) ou o CEP do tomador do serviço.",
    "E56": "Campo endereço do tomador não informado (obrigatório para tomador com CNPJ). O preenchimento do endereço (logradouro) é obrigatório para tomadores Pessoas Jurídicas (com CNPJ).",
    "E57": "Bairro não corresponde ao CEP informado. Corrija o Bairro ou o CEP do tomador do serviço.",
    "E58": "Código do município do tomador não corresponde ao CEP informado. Corrija o código do município ou o CEP do tomador do serviço.",
    "E59": "Campo cidade do tomador não informado (obrigatório para tomador com CNPJ). O preenchimento da Cidade do Tomador é obrigatório para tomadores Pessoas Jurídicas (com CNPJ).",
    "E60": "A cidade do tomador informada não foi encontrada na base de dados da prefeitura. Informe a cidade correta do tomador. No caso de cidade do exterior (fora do país), informe o campo com 99999.",
    "E61": "Sigla da UF do tomador não corresponde ao CEP informado. Corrija a sigla da UF ou o CEP do tomador do serviço.",
    "E62": "CEP não existe na tabela DNE dos Correios. Informe o CEP correto.",
    "E63": "Razão social do intermediário do serviço não informada com CNPJ/CPF ou Inscrição Municipal do intermediário informada. Informe a razão social do intermediário do serviço.",
    "E64": "Inscrição Municipal do intermediário do serviço inválida. Informe a Inscrição Municipal correta do intermediário do serviço.",
    "E65": "Inscrição Municipal do intermediário do serviço não está vinculada ao CNPJ/CPF informado. Acerte a Inscrição Municipal ou o CNPJ/CPF do intermediário do serviço.",
    "E66": "CNPJ/CPF do Intermediário do Serviço inválido. Informe o CNPJ/CPF correto do intermediário do serviço.",
    "E67": "Código da obra inválido. Informe o código da obra correto.",
    "E68": "Status do RPS inválido. Utilize um dos tipos: 1 – Normal; 2 – Cancelado.",
    "E69": "Quantidade de RPS incorreta. Informe a quantidade de RPS correta.",
    "E70": "Inscrição Municipal do prestador especificada no lote não confere com o prestador informado no RPS. Informe corretamente a Inscrição Municipal do prestador no lote e no RPS.",
    "E71": "RPS em duplicidade no arquivo enviado. Remova do arquivo o registro de RPS excedente.",
    "E72": "Campo Quantidade de RPS informado incorretamente. O campo quantidade de RPS é numérico e deverá ter tamanho máximo de 4 dígitos.",
    "E73": "Campo tipo do RPS inválido para o tipo de registro='3' (Cupons). Utilize o tipo 'RPS-C'.",
    "E74": "Data de emissão da Nota Fiscal não está compreendida entre a data de início de emissão do lote e a data de fim de emissão do lote, conforme especificado no cabeçalho do arquivo. Utilize no cabeçalho do arquivo datas de emissão da Nota Fiscal compreendidas entre a data de início de emissão do lote e a data de fim de emissão do lote.",
    "E75": "Número do RPS substituído não informado para status do RPS igual a 'S'. Informe o número do RPS substituído.",
    "E76": "O número do RPS substituído informado não existe na base de dados. Informe o número do RPS substituído correto.",
    "E77": "Número da NFS-e não informado. Informe o número da NFS-e.",
    "E78": "Número da NFS-e inexistente na base de dados para o prestador de serviço pesquisado. Informe o número correto da NFS-e.",
    "E79": "Essa NFS-e já está cancelada. Confira e informe novamente os dados da NFS-e que deseja cancelar.",
    "E80": "Código de verificação não informado. Informe o código de verificação da NFS-e.",
    "E81": "Código de verificação não corresponde à NFS-e consultada. Informe o código de verificação correto.",
    "E82": "Pesquisa pela atividade só pode ser feita com a indicação de um cep ou bairro. Informe um cep ou um bairro.",
    "E83": "Campo Inscrição Municipal do tomador informado incorretamente. O campo Inscrição Municipal do tomador é numérico e deverá ter tamanho máximo de 15 dígitos.",
    "E84": "Pesquisa pelo cep só pode ser feita com a indicação de uma atividade. Informe uma atividade.",
    "E85": "Pesquisa pelo bairro só pode ser feita com a indicação de uma atividade. Informe uma atividade.",
    "E86": "Número do protocolo de recebimento do lote inexistente na base de dados. Confira se o lote foi enviado e informe o número correto do protocolo de recebimento.",
    "E87": "Número de lote inexistente na base de dados. Confira se o lote foi enviado e informe o número correto.",
    "E88": "Número de lote não informado. Informe o número do lote.",
    "E89": "Não existe na base de dados uma NFS-e emitida para o número de RPS informado. Informe o número correto do RPS.",
    "E90": "Número do RPS inválido. Informe um número de RPS que corresponda à sequência utilizada pelo prestador de serviço.",
    "E91": "Esse RPS não foi enviado para a nossa base de dados. Exija do prestador do serviço a emissão da NFS-e.",
    "E92": "Esse RPS foi enviado para a nossa base de dados, mas ainda não foi processado. Faça uma nova consulta mais tarde.",
    "E93": "Série informada inválida. Informe a série correta para o RPS pesquisado.",
    "E94": "Mês de competência não informado. Informe o mês de competência no formato AAAAMM.",
    "E95": "Mês de competência informado incorretamente. Informe o mês de competência no formato AAAAMM.",
    "E96": "Campo número do RPS informado incorretamente. O campo Número do RPS é numérico e deverá ter tamanho máximo de 15 dígitos.",
    "E97": "Campo série do RPS informado incorretamente. O campo Série do RPS é alfa-numérico e deverá ter tamanho máximo de 5 caracteres.",
    "E98": "Valor dos serviços não informado. Informe o valor dos serviços.",
    "E99": "Valor da retenção deverá ser inferior ou igual ao valor dos serviços. Não é permitido valor de retenção superior ao valor de serviços.",
    "E100": "Campo valor dos serviços informado incorretamente. O campo valor dos serviços é numérico e deverá ter tamanho máximo de 15,2, ou seja, 15 números inteiros e dois decimais.",
    "E101": "Campo deduções informado incorretamente. O campo valor das deduções é numérico e deverá ter tamanho máximo de 15,2, ou seja, 15 números inteiros e dois decimais.",
    "E102": "Campo descontos informado incorretamente. O campo valor dos descontos é numérico e deverá ter tamanho máximo de 15,2, ou seja, 15 números inteiros e dois decimais.",
    "E103": "Retenção de tributo federal informada incorretamente. O campo referente a retenção de tributo federal é numérico e deverá ter tamanho máximo de 15,2, ou seja, 15 números inteiros e dois decimais.",
    "E104": "Campo item da lista de serviço informado incorretamente. O campo item da lista de serviço deverá ter tamanho máximo de 4 caracteres.",
    "E105": "Campo código CNAE informado incorretamente. O campo código CNAE deverá ter tamanho máximo de 7 caracteres.",
    "E106": "Campo código de tributação do município informado incorretamente. O campo código de tributação do município deverá ter tamanho máximo de 20 caracteres.",
    "E107": "Campo discriminação do serviço informado incorretamente. O campo discriminação do serviço deverá ter tamanho máximo de 2000 caracteres.",
    "E108": "Campo município da prestação do serviço informado incorretamente. O campo município da prestação do serviço deverá ter tamanho máximo de 7 dígitos.",
    "E109": "Campo cidade do tomador informado incorretamente. O campo cidade do tomador deverá ter tamanho máximo de 7 dígitos. Consulte tabela do IBGE.",
    "E110": "Quando a natureza da operação for tributação fora do município, o campo município da prestação do serviço deverá ser diferente do município do prestador. Informe o município da prestação do serviço corretamente.",
    "E111": "Município da prestação do serviço não informado. Informe o município da prestação do serviço, de acordo com a tabela do IBGE.",
    "E112": "Campo Inscrição Municipal do intermediário informado incorretamente. O campo Inscrição Municipal do intermediário é numérico e deverá ter tamanho máximo de 15 dígitos.",
    "E113": "Campo número do endereço do tomador não informado (obrigatório para tomador com CNPJ). A informação do número do endereço do tomador é obrigatória para tomadores pessoas jurídicas (com CNPJ).",
    "E114": "Campo bairro do tomador não informado (obrigatório para tomador com CNPJ). A informação do bairro do tomador é obrigatória para tomadores pessoas jurídicas (com CNPJ).",
    "E115": "Campo UF do tomador não informado (obrigatório para tomador com CNPJ). O preenchimento da UF do tomador é obrigatório para tomadores pessoas jurídicas (com CNPJ).",
    "E116": "A UF do tomador informada não foi encontrada na base de dados. Informe a UF correta do tomador. Em caso de cidades do exterior (fora do país), preencher a UF com 'EX' e a cidade do tomador com 99999.",
    "E117": "Campo razão social do tomador informado incorretamente. O campo razão social do tomador deverá ter tamanho máximo de 115 caracteres.",
    "E118": "Campo razão social do tomador não informado. O campo razão social do tomador deverá ser informado quando o campo Indicador de CPF/CNPJ do tomador for preenchido com 1 - CPF ou 2 - CNPJ.",
    "E119": "Campo endereço do tomador informado incorretamente. O campo endereço do tomador deverá ter tamanho máximo de 125 caracteres.",
    "E120": "Campo número do endereço do tomador informado incorretamente. O campo número do endereço do tomador deverá ter tamanho máximo de 10 caracteres.",
    "E121": "Campo complemento do endereço do tomador informado incorretamente. O campo complemento do endereço do tomador deverá ter tamanho máximo de 60 caracteres.",
    "E122": "Campo bairro do tomador informado incorretamente. O campo bairro do tomador deverá ter tamanho máximo de 60 caracteres.",
    "E123": "Campo AliquotaServicos não informado para tributação fora do município. Informe a alíquota do ISS quando a tributação for fora do município.",
    "E124": "Campo UF do tomador informado incorretamente. O campo UF do tomador deverá ter tamanho máximo de 2 caracteres.",
    "E125": "Campo CEP do tomador informado incorretamente. O campo CEP do tomador deverá ter tamanho máximo de 8 dígitos.",
    "E126": "Campo e-mail do tomador informado incorretamente. O campo e-mail do tomador deverá ter tamanho máximo de 80 caracteres.",
    "E127": "Campo telefone do tomador informado incorretamente. O campo telefone do tomador deverá ter tamanho máximo de 11 caracteres.",
    "E128": "Campo razão social do intermediário do serviço informado incorretamente. O campo razão social do intermediário do serviço deverá ter tamanho máximo de 115 caracteres.",
    "E129": "Campo código da obra informado incorretamente. O campo código da obra deverá ter tamanho máximo de 15 caracteres.",
    "E130": "Campo ART informado incorretamente. O campo ART deverá ter tamanho máximo de 15 caracteres.",
    "E131": "Campo data inicial preenchido incorretamente. A data informada deverá estar no formato DD/MM/AAAA, ou seja, dia (2 dígitos), seguido de mês (2 dígitos) e ano (4 dígitos) e deve ser uma data válida.",
    "E132": "Campo data final preenchido incorretamente. A data informada deverá estar no formato DD/MM/AAAA, ou seja, dia (2 dígitos), seguido de mês (2 dígitos) e ano (4 dígitos) e deve ser uma data válida.",
    "E133": "Data final da pesquisa não poderá ser superior a data de hoje. Informe uma data final igual ou anterior à data de hoje.",
    "E134": "A data final não poderá ser anterior à data inicial. Informe uma data final igual ou superior à data inicial da pesquisa.",
    "E135": "O período de pesquisa não poderá ser superior a um ano. Limitar as datas de início e final a um período de um ano.",
    "E136": "Campo número da NFS-e informado incorretamente. O campo número da NFS-e é numérico e deverá ter tamanho máximo de 15 dígitos",
    "E137": "Data de emissão da NFS-e informada incorretamente. Informe a data correta da emissão da NFS-e a ser consultada.",
    "E138": "CNPJ não autorizado a realizar o serviço. Informe o CNPJ autorizado a executar o serviço.",
    "E139": "Campo número da NFS-e substituída informado incorretamente. O campo número da NFS-e substituída é numérico e deverá ter tamanho máximo de 15 dígitos.",
    "E140": "Bairro do prestador inexistente.",
    "E141": "Inscrição Municipal do prestador não informada. Informe a Inscrição Municipal do prestador.",
    "E142": "Inscrição Municipal do prestador não está vinculada ao CNPJ informado. Acerte a Inscrição Municipal ou o CNPJ do prestador.",
    "E143": "Inscrição Municipal do tomador não está vinculada ao CNPJ informado. Acerte a Inscrição Municipal ou o CNPJ do tomador.",
    "E144": "Natureza da operação inválida. Utilize um dos tipos: 01 – Tributação no município; 02 – Tributação fora do município; 03 – Isenção; 04 – Imune; 05 – Exigibilidade suspensa por decisão judicial; 06 – Exigibilidade suspensa por procedimento administrativo.",
    "E145": "Regime Especial de Tributação inválido. Utilize um dos tipos: 01 – Microempresa Municipal; 02 – Estimativa; 03 – Sociedade de Profissionais; 4 – Cooperativa; 5 - Microempresário Individual (MEI) 6 - Microempresário e Empresa de Pequeno Porte (ME EPP).",
    "E146": "Informação de optante pelo simples nacional inválida. Utilize um dos tipos: 1 – Sim; 2 - Não.",
    "E147": "Informação de incentivador cultural inválida. Utilize um dos tipos: 1 – Sim; 2 - Não.",
    "E148": "Status do RPS não informado. Informe o status do RPS.",
    "E149": "Campo CNPJPrestador informado incorretamente. O campo CNPJPrestador é numérico e deverá ter tamanho máximo de 14 dígitos.",
    "E150": "Série do RPS não informada. Campo de preenchimento obrigatório, caso não utilize série, preencha o campo com 00000.",
    "E151": "Quantidade de RPS não informada. Informe a quantidade de RPS.",
    "E152": "Campo ISSRetido não informado. Informe um dos tipos: 1 para ISS Retido ou 2 para ISS não Retido.",
    "E153": "Campo ValorISSRetido informado incorretamente. O campo ValorISSRetido é numérico e deverá ter tamanho máximo de 15,2, ou seja, 15 números inteiros e dois decimais.",
    "E154": "Campo CNPJ/CPF do Intermediario do Serviço informado incorretamente. O campo CNPJ/CPF do Intermediario do Serviço é numérico e deverá ter tamanho máximo de 14 dígitos.",
    "E155": "Campo CPFCNPJTomador informado incorretamente. O campo CPFCNPJTomador é numérico e deverá ter tamanho máximo de 14 dígitos.",
    "E156": "CNPJ do prestador não autorizado a emitir NFS-e. Solicite autorização para emitir NFS-e para o CNPJ informado.",
    "E157": "Usuário não está autorizado a utilizar esse serviço para esse contribuinte. Solicite ao contribuinte autorização para utilizar o serviço em seu nome.",
    "E158": "Campo Inscrição Municipal do prestador informado incorretamente. O campo Inscrição Municipal do prestador é numérico e deverá ter tamanho máximo de 15 dígitos.",
    "E159": "CNPJ do prestador especificado no lote não confere com o prestador informado no RPS. Informe corretamente o CNPJ do prestador no lote e no RPS.",
    "E160": "Arquivo enviado fora da estrutura do arquivo XML de entrada. Envie um arquivo dentro do schema do arquivo XML de entrada.",
    "E161": "Campo ValorISS não informado para tributação fora do município. Informe o valor do ISS quando a tributação for fora do município."

  }
}
